pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fe423a.h
/* Messages from ESP */
#define mEVENT                 (0x0001)       /* Event Status Flag for ESP430 Software */
#define mTEMPRDY               (0x0003)       /* Temperature measurement completed and in MBIN1 */
#define mSWRDY                 (0x0005)       /* Software version in MBIN1 */
#define mPARAMRDY              (0x0007)       /* Parameter requested by mREAD_PARAM returned in MBIN1  */
#define mPARAMSET              (0x0009)       /* Parameter has been set */
#define mI2RDY                 (0x000B)       /* I2 value ready */

/* EVENT: Event Message Enable Bits */
#define WFSRDYME               (0x0001)       /* New waveform Samples ready */
#define I2GTI1ME               (0x0002)       /* Current I2 greater then I1 */
#define ILREACHEDME            (0x0004)       /* Interrupt level reached */
#define ENRDYME                (0x0008)       /* New Energy values ready */
#define ZXLDME                 (0x0010)       /* Zero Crossing of V1 (leading edge) */
#define ZXTRME                 (0x0020)       /* Zero Crossing of V1 (trailing edge) */
#define CALRDYME               (0x0040)       /* Calibration values ready */
#define TAMPME                 (0x0080)       /* Tampering Occured */
#define NEGENME                (0x0100)       /* Negativ Energy */
#define VDROPME                (0x0200)       /* Voltage drop occured */
#define VPEAKME                (0x0400)       /* Voltage exceed VPeak level */
#define I1PEAKME               (0x0800)       /* Current exceed I1Peak level */
#define I2PEAKME               (0x1000)       /* Current exceed I2Peak level */
//#define RESERVED            (0x8000)  /* Reserved */
//#define RESERVED            (0x8000)  /* Reserved */
#define ACTIVEME               (0x8000)       /* Measurement of Calibration running */

/* ESP Modes */
#define modeIDLE               (0x0000)       /* Set Mode: Idle Mode */
#define modeCALIBRATION        (0x0002)       /* Set Mode: Calibration Mode */
#define modeMEASURE            (0x0004)       /* Set Mode: Measure Mode */
#define modeRESET              (0x0006)       /* Set Mode: Reset and Restart the ESP430 module */
#define modeINIT               (0x0008)       /* Set Mode: Initialize ESP430 module */

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define BASICTIMER_VECTOR       ( 1)                     /* 0xFFE0 Basic Timer */
#define PORT2_VECTOR            ( 2)                     /* 0xFFE2 Port 2 */
#define PORT1_VECTOR            ( 5)                     /* 0xFFE8 Port 1 */
#define TIMERA1_VECTOR          ( 6)                     /* 0xFFEA Timer A CC1-2, TA */
#define TIMERA0_VECTOR          ( 7)                     /* 0xFFEC Timer A CC0 */
#define USART0TX_VECTOR         ( 9)                     /* 0xFFF0 USART 0 Transmit */
#define USART0RX_VECTOR         (10)                     /* 0xFFF2 USART 0 Receive */
#define WDT_VECTOR              (11)                     /* 0xFFF4 Watchdog Timer */

#define SD16_VECTOR             (13)                     /* 0xFFF8 Sigma Delta ADC */
#define ESP430_VECTOR           (14)                     /* 0xFFFA ESP430 Mailbox */

#define NMI_VECTOR              (15)                     /* 0xFFFC Non-maskable */
#define RESET_VECTOR            ("reset")                /* 0xFFFE Reset [Highest Priority] */


/************************************************************
* End of Modules
************************************************************/

#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430xE42x */

